// ЧТО ТАКОЕ ПОТОК И ПРОЦЕСС И В ЧЕМ РАЗЛИЧИЯ ?

// Процесс разделяется на потоки, которые работают в одном процессе
// У разных процессов разная память, но потоки в одном и том же процессе
// используют одну и ту же память внутри процесса, потоки могут быть парралельны

// Многопоточность - в программе существуют множество потоков
// Состояния потокоа:
// 1) выполнение
// 2) ожидание
// 3) готовности
// 4) переходное
// 5) завершения

// КТО И КАК УПРАВЛЯЕТ ГОРУТИНЫ И В RUNTIME GOLANG ?
// СБОРЩИК МУСОРА ?
// ПРОКСИРОВАНИЕ КЭШЕРОВАНИЕ ?
// ПОИСК СОРТИРОВКА СЛИЯНИЕ  (АЛГОРИТМЫ)?
// КАК УСТРОЕНЫ СЕТИ
// КАК ПРОЦЕССОР ВЫПОЛНЯЕТ ПРОГРАММНЫЙ КОД КАК ОН ВЗАИМОДЕЙСТВУЕТ С ПАМЯТЬЮ И КАК УСТРОЕНА ИЕРАРХИЯ ПАМЯТИ