// Cache

// когда использует и зачем

// это in-memory хранилище, которое используется для хранения в RAM(оперативная память)
// Основные характеристики RAM:
// Быстрый доступ: RAM обеспечивает очень быстрый доступ к данным по сравнению с другими типами памяти, такими как жесткий диск (HDD) или твердотельный накопитель (SSD).

// Энергозависимость: Данные в RAM сохраняются только пока компьютер включен. При выключении питания все данные в RAM теряются.

// Оперативная работа: RAM используется для временного хранения данных, с которыми работает операционная система, приложения и программы.

